aeroblade/templates/cold-periodic-cascade-2d/0/T
FoamFile {version 2.0; format ascii; class volScalarField; object T;}
dimensions [0 0 0 1 0 0 0];
internalField uniform {{INLET_TOTAL_TEMPERATURE_K}};
boundaryField { cyclicLow {type cyclic;} cyclicHigh {type cyclic;} spanLow {type empty;} spanHigh {type empty;} inlet {type totalTemperature; T0 uniform {{INLET_TOTAL_TEMPERATURE_K}}; gamma 1.4; psi thermo:psi; value uniform {{INLET_TOTAL_TEMPERATURE_K}};} outlet {type inletOutlet; inletValue uniform {{INLET_TOTAL_TEMPERATURE_K}}; value uniform {{INLET_TOTAL_TEMPERATURE_K}};} blade {type zeroGradient;} }
