aeroblade/templates/cold-periodic-cascade-2d/constant/thermophysicalProperties
FoamFile {version 2.0; format ascii; class dictionary; object thermophysicalProperties;}

thermoType {type hePsiThermo; mixture pureMixture; transport const; thermo hConst;
 equationOfState perfectGas; specie specie; energy sensibleEnthalpy;}
mixture {specie {molWeight 28.96;} thermodynamics {Cp 1004.5; Hf 0;} transport {mu 1.8e-05; Pr 0.7;}}
